### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
Players = len(purchase_data["SN"].unique())

In [4]:
print(Players)

576

In [5]:
player_table = pd.DataFrame({"Total Players":[Players]})
player_table

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [6]:
Unique_items = len(purchase_data["Item ID"].value_counts())
print(Unique_items)

183

In [7]:
Average_Price = purchase_data["Price"].mean()
print(Average_Price)

3.050987179487176

In [8]:
Number_of_Purchases = len(purchase_data["Purchase ID"])
print(Number_of_Purchases)

780

In [9]:
Revenue = purchase_data["Price"].sum()
print(Revenue)

2379.77

In [10]:
Purchase_Analysis = pd.DataFrame({"Number of Unique Items":[Unique_items],
                                      "Average Price":[Average_Price],
                                  "Number of Purchases":[Number_of_Purchases],
                                  "Revenue":[Revenue]})
Purchase_Analysis

   Number of Unique Items  Average Price  Number of Purchases  Revenue
0                     183       3.050987                  780  2379.77

In [11]:
Purchase_Analysis["Average Price"] = Purchase_Analysis["Average Price"].astype(float).map(
    "${:,.2f}".format)

In [12]:
Purchase_Analysis["Revenue"] = Purchase_Analysis["Revenue"].astype(float).map(
    "${:,.2f}".format)

In [13]:
Purchase_Analysis

   Number of Unique Items Average Price  Number of Purchases    Revenue
0                     183         $3.05                  780  $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [72]:
# Gender_group = purchase_data.groupby('Gender')
# count_genders = Gender_group['Gender'].count()
#Gender_group = purchase_data.groupby("SN")["Gender"].value_counts()
Gender_group = purchase_data.drop_duplicates(['SN'], keep ='last')
# count_genders = purchase_data["Gender"].value_counts()
#Gender_group
# count_genders = Gender_group["Gender"].count()
# count_genders
Gender_df = pd.DataFrame(purchase_data)

In [82]:
#count_genders = Gender_group['Gender'].value_counts().reset_index()
count_genders = Gender_df.groupby(['Gender']).nunique()["SN"]
count_genders

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [83]:
type(count_genders)

pandas.core.series.Series

In [85]:
Gender_Pct = count_genders / Players * 100
Gender_Pct

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: SN, dtype: float64

In [86]:
Gender_Demographics = pd.DataFrame({ "# of Players":count_genders,
                                      "Percent of Players":Gender_Pct})
Gender_Demographics

                       # of Players  Percent of Players
Gender
Female                           81           14.062500
Male                            484           84.027778
Other / Non-Disclosed            11            1.909722


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [22]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [23]:
Purch_by_Gender = pd.DataFrame(purchase_data)

In [24]:
GenderPurchases = Purch_by_Gender.groupby(["Gender"]).count()["Price"]
print(GenderPurchases)

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [25]:
GenderAvgPurchases = Purch_by_Gender.groupby(["Gender"]).mean()["Price"]
print(GenderAvgPurchases)

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [26]:
GenderTotPurchases = Purch_by_Gender.groupby(["Gender"]).sum()["Price"]
print(GenderTotPurchases)

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [27]:
Gender_unique = purchase_data.drop_duplicates(['SN'], keep ='last')

In [28]:
count_unique_genders = Gender_group['Gender'].value_counts()

In [29]:
Gender_Avg_per_person = GenderTotPurchases / count_unique_genders

In [30]:
count_unique_genders

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [31]:
Gender_Purchase_Analysis = pd.DataFrame({"Purchase_count":GenderPurchases,
                                         "Average Purchase":GenderAvgPurchases,
                                         "Total Purchases":GenderTotPurchases,
                                         "Average Purchase Per Person":Gender_Avg_per_person})

In [32]:
Gender_Purchase_Analysis

,Purchase_count,Average Purchase,Total Purchases,Average Purchase Per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [33]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [34]:
df = pd.DataFrame(purchase_data)
df2 = purchase_data.drop_duplicates(['SN'], keep ='last')

In [35]:
#create bins
bins = [0,9,14,19,24,29,34,39,100]
#create names
group_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [36]:
pd.cut(df2["Age"], bins, labels=group_names).head()

1      40+
2    20-24
3    20-24
4    20-24
6    35-39
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [87]:
df2["Age Group"] = pd.cut(df2["Age"], bins, labels=group_names)
df2.head()

C:\Users\Bobby\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group,Total Count,% of Players
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+,NaN,NaN
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24,NaN,NaN
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24,NaN,NaN
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24,NaN,NaN
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18,35-39,NaN,NaN

In [38]:
#Create Groupby Object based on "Age Group"
age_grouping = df2.groupby("Age Group")

#Find rows in each bin
print(age_grouping["SN"].count())

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [88]:
T = age_grouping["SN"].count()
print(T)
#df2["Total Count"] = T

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [89]:
P = T / Players
print(P)

Age Group
<10      0.029514
10-14    0.038194
15-19    0.185764
20-24    0.447917
25-29    0.133681
30-34    0.090278
35-39    0.053819
40+      0.020833
Name: SN, dtype: float64

In [91]:
Age_Demographics = pd.DataFrame({ "Total Count":T,
                                      "Percent of Players":P})
Age_Demographics

           Total Count  Percent of Players
Age Group
<10                 17            0.029514
10-14               22            0.038194
15-19              107            0.185764
20-24              258            0.447917
25-29               77            0.133681
30-34               52            0.090278
35-39               31            0.053819
40+                 12            0.020833

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [42]:
pd.cut(df["Age"], bins, labels=group_names).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [43]:
df["Age Group"] = pd.cut(df["Age"], bins, labels=group_names)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [44]:
#Create Groupby Object based on "Age Group"
age_grouping_purchases = df.groupby("Age Group")

#Find rows in each bin
print(age_grouping_purchases["SN"].count())

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: SN, dtype: int64

In [45]:
age_purchases = (age_grouping_purchases["SN"].count())
print(age_purchases)

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: SN, dtype: int64

In [46]:
age_avg_purch = (age_grouping_purchases["Price"].mean())
print(age_avg_purch)

Age Group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [47]:
age_tot_purch = (age_grouping_purchases["Price"].sum())
print(age_tot_purch)

Age Group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [92]:

age_purch_per = age_tot_purch / T
print(age_purch_per)

Age Group
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [94]:
Age_Purchases = pd.DataFrame({ "Purchase Count":age_purchases,
                              "Average Purchase Price":age_avg_purch,
                              "Total Purchase Value":age_tot_purch,
                                      "Avg Total Purchase":age_purch_per})
Age_Purchases

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase
Age Group,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [49]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [50]:
# Count of Purchases by Person
Purch_per_Person = pd.DataFrame(purchase_data.groupby('SN')['Price'].count())

In [51]:
# Avg Purchase Price
Avg_per_Person = pd.DataFrame(purchase_data.groupby('SN')['Price'].mean())

In [52]:
# Total Purchases
Total_per_Person = pd.DataFrame(purchase_data.groupby('SN')['Price'].sum())

In [53]:
#Merge first 2 df's
Combined_Purchasers_df = pd.merge(Purch_per_Person, Avg_per_Person, how='inner', on='SN')
Combined_Purchasers_df.head()

              Price_x  Price_y
SN
Adairialis76        1     2.28
Adastirin33         1     4.48
Aeda94              1     4.91
Aela59              1     4.32
Aelaria33           1     1.79

In [54]:
#Rename columns
Combined_Purchasers_df = Combined_Purchasers_df.rename(columns={"Price_x":"Total Purchases", 
                                                                "Price_y": "Average Purchase Proce"})
Combined_Purchasers_df.head()

              Total Purchases  Average Purchase Proce
SN
Adairialis76                1                    2.28
Adastirin33                 1                    4.48
Aeda94                      1                    4.91
Aela59                      1                    4.32
Aelaria33                   1                    1.79

In [55]:
#merge last df
Combined_Purchasers_df = pd.merge(Combined_Purchasers_df, Total_per_Person, how='left', on='SN')
Combined_Purchasers_df.head(20)

               Total Purchases  Average Purchase Proce  Price
SN
Adairialis76                 1                2.280000   2.28
Adastirin33                  1                4.480000   4.48
Aeda94                       1                4.910000   4.91
Aela59                       1                4.320000   4.32
Aelaria33                    1                1.790000   1.79
Aelastirin39                 2                3.645000   7.29
Aelidru27                    1                1.090000   1.09
Aelin32                      3                2.993333   8.98
Aelly27                      2                3.395000   6.79
Aellynun67                   1                3.740000   3.74
Aellyria80                   1                3.080000   3.08
Aelollo59                    2                2.815000   5.63
Aenarap34                    1                2.960000   2.96
Aeral43                      1                4.400000   4.40
Aeral68                      1                4.000000   4.00
Aeral97                      1                4.800000   4.80
Aeralria27                   1                4.090000   4.09
Aeralstical35                1                2.960000   2.96
Aeri84                       1                1.610000   1.61
Aerillorin70                 1                3.330000   3.33

In [56]:
Combined_Purchasers_df = Combined_Purchasers_df.rename(columns={"Average Purchase Proce":"Average Purchase Price", 
                                                                "Price": "Total Price"})
Combined_Purchasers_df.head()

              Total Purchases  Average Purchase Price  Total Price
SN
Adairialis76                1                    2.28         2.28
Adastirin33                 1                    4.48         4.48
Aeda94                      1                    4.91         4.91
Aela59                      1                    4.32         4.32
Aelaria33                   1                    1.79         1.79

In [57]:
Combined_Purchasers_df.sort_values('Total Price',ascending=False, inplace=True)
Combined_Purchasers_df.head()

             Total Purchases  Average Purchase Price  Total Price
SN
Lisosia93                  5                3.792000        18.96
Idastidru52                4                3.862500        15.45
Chamjask73                 3                4.610000        13.83
Iral74                     4                3.405000        13.62
Iskadarya95                3                4.366667        13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [58]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [59]:
reduced_purchases = purchase_data.iloc[:, [4,5,6]]
reduced_purchases.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [98]:
Popular_Items = pd.DataFrame(reduced_purchases)
#                             .groupby('Item ID')['Item Name'])

In [132]:
Pop_Purchases = Popular_Items.groupby(['Item ID','Item Name']).count()["Price"]

In [131]:
#Pop_Price = Popular_Items.groupby('Item ID')['Price'].mean()
Pop_Price = Popular_Items.groupby(['Item ID','Item Name']).mean()["Price"]

In [133]:
Pop_Total = Popular_Items.groupby(['Item ID','Item Name']).sum()["Price"]

In [139]:
Most_Popular_Items = pd.DataFrame({ "Purchase Count":Pop_Purchases,
                              "Item Price":Pop_Price,
                              "Total Purchase Value":Pop_Total})
Most_Popular_Items.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4        1.28                  5.12
1       Crucifer                         3        3.26                  9.78
2       Verdict                          6        2.48                 14.88
3       Phantomlight                     6        2.49                 14.94
4       Bloodlord's Fetish               5        1.70                  8.50

In [140]:
Purchase_sort = Most_Popular_Items.sort_values('Purchase Count',ascending=False)

In [142]:
Purchase_sort.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [144]:
Most_Profitable_sort = Most_Popular_Items.sort_values('Total Purchase Value',ascending=False)

In [145]:
Most_Profitable_sort.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80